---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewGraphSunPathSize
source: html/92798aa9-0f01-0415-a441-a210b69e93cc.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewGraphSunPathSize Property

"Sun path size (%)"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewGraphSunPathSize { get; }
```